app/controllers/application_controller.rb

  def set_current_user
    flash.now[:notice]="Logged in successfully"
    flash.now[:alert]="Invalid email or password"
    if session[:user_id]
      Current.user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]