app/controllers/passwords_controller.rb

UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "[FILTERED]"], ["updated_at", "2023-03-06 21:59:02.176992"], ["id", 10]]
---
  def update
    if Current.user.update(password_params)