app/controllers/password_resets_controller.rb

  def create
    @uset= User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "555@gmail.com"], ["LIMIT", 1]]