app/controllers/registrations_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Stacy"], ["email", "stacy@gmail.com"], ["password", "[FILTERED]"], ["created_at", "2023-03-02 19:04:50.880172"], ["updated_at", "2023-03-02 19:04:50.880172"]]